<template>
  <div class="teanew">
    <!-- banner -->
    <div class="banner">
      <img src="../statics/img/teanew/banner.jpg" alt />
    </div>
    <!-- main -->
    <div class="main">
      <div class="from">
        <div>
          <img src="../statics/img/teanew/1.png" alt />
        </div>
        <div class="fromTxt">
          <p v-for="(item, index) in fromArr" :key="index">{{item.text}}</p>
        </div>
      </div>
      <div class="infoList">
        <ul>
          <li v-for="(item, index) in infoListArr" :key="index">
            <div class="times" @click="postData(index)">
              <p>10</p>
              <p>2016/10</p>
            </div>
            <div class="craft">
              <p class="craftName" @click="postData(index)">{{item.titleName}}</p>
              <p class="craftNews">{{item.text1}}</p>
            </div>
          </li>
        </ul>
      </div>
    </div>
    <!-- bannerAndInfo -->
    <div class="bannerAndInfo">
      <div class="bannerAndInfo-l">
        <!-- lunbo -->
        <el-carousel :interval="3000">
          <el-carousel-item v-for="(item, index) in lunboArr" :key="index">
            <div>
              <img :src="item.pic" alt />
            </div>
            <div class="textNote">{{item.txt}}</div>
          </el-carousel-item>
        </el-carousel>
      </div>
      <div class="bannerAndInfo-r">
        <el-timeline :reverse="reverse">
          <el-timeline-item
            v-for="(item, index) in littleInfoListArr"
            :key="index"
            :timestamp="item.text1"
          >
            <div style="cursor:pointer" @click="postData(index)">{{item.titleName}}</div>
          </el-timeline-item>
        </el-timeline>
      </div>
    </div>
  </div>
</template>
<script>
// import bus from "../bus/bus.js";
export default {
  data() {
    return {
      fromArr: [
        { text: "中华茶道，源远流长" },
        { text: "却被忙碌浮躁的现代人所怠慢。" },
        { text: "红尘滚滚，沧海逐浪，人生，总值得在这样一个清静的黄昏，" },
        { text: "停下疲惫的脚步，泡一壶茶，" },
        { text: "雕刻一段美好的时光，于满心的欣喜里，" },
        { text: "慢慢品味偷得浮生半日闲的惬意..." }
      ],
      infoListArr: [
        {
          titleName: "普洱茶生茶采摘及传统加工工艺流程",
          img1: require("../statics/img/teanew/2.jpg"),
          img2: require("../statics/img/teanew/3.jpg"),
          text1:
            "普洱茶生茶采摘大叶种鲜叶制成的晒青毛茶，其形态为散茶或压制成各种形状的紧压茶。",
          text2:
            "加工工艺：大叶种鲜叶→杀青→揉捻→晒干→滇青毛茶→自然发酵→散茶滇青毛茶→紧压成型→饼茶普洱茶熟茶。",
          text3:
            "生茶以自然方式贮放发酵，耐贮放，可以存放15年以上，经后发酵茶性转温和。这也是传统工艺的普洱茶。20世纪70年代，在传统工艺基础上，引入人工渥堆发酵工艺，使普洱茶在短时间内就能达到贮放多年的品质，习惯上称为“熟茶”，就是人工发酵普洱茶，或现代工艺普洱茶。这种熟茶，再经过一段时间的贮放，短的甚至几个月，便可以在市场上流通了。品质好的熟茶干茶色泽褐红或深栗色，俗称“猪肝红”，汤色红浓透明，滋味醇厚，顺滑甘甜，无霉味。"
        },
        {
          titleName: "韩国的传统茶饮茶习俗",
          img1: require("../statics/img/teanew/4.jpg"),
          img2: require("/"),
          text1:
            "韩国的传统茶是韩国饮茶的一种品类。本来韩国人的饮茶习俗是从中国传入的，起初的饮法与我国大体相同；可是他们在学习中国的煎茶法、点茶法和绝茶法的基础上，还衍生出一种煮茶法。煮茶就是将茶汤里的茶叶换成各种食料，而且还要加入蜂蜜或白糖。这种饮法至今仍然流行，与他们饮用中国绿茶的习惯并行不悖地存在着，为了区别干饮绿茶，他们称传统的饮茶法叫传统茶。",
          text2:
            "这种传统茶的制法，不是用沸水冲泡，而是用熟水长时间浸泡各种食料经发酵后，再进行熬煮而成的。作为熬茶的食料有很多种，譬如五谷杂粮、草药、水果、干果、蔬菜等都可以用来浸泡和煮茶。严格说来，因为浸泡的食料里面没有茶叶，不应该叫做茶，但由于这是从饮茶演变过来的，他们还是称之为茶。据说这种传统茶大都具有养生健身的作用。如大麦茶、艾草茶能够促进消化，增加食欲；松针茶能够润喉；柚子茶能够祛除风寒；辣椒茶能够开胃补虚；大枣茶、莲花茶能够镇静安神；青梅茶、柚子茶、柿子茶、橘皮茶、石榴茶等水果茶在饭后饮用能够解腻帮助消化。",
          text3:
            "总之，各种各样的传统茶都是经过一年左右的浸泡和发酵，煮沸后再加上白糖，除了味道很甜美之外，还在色香味上各有千秋。譬如用百年草（一种仙人掌的果实）制成的茶，澄明洁净，色绿晶莹，再加上几片玫瑰花瓣，红绿相映，非常美观，尤其是喝到嘴里，甜香可口，帮助消化，是一种佐餐的好饮料。",
          text4:
            " 在韩国，咖啡店、酒吧和自动饮料售货机都有瓶装的传统茶出售。要是想体味传统茶的韵味，是到专营传统茶的茶馆去饮用。这里的传统茶都是茶馆自家制作的，较之批量生产的更是风味独到，别具特色。"
        },
        {
          titleName: "茶倒七分，是人生的一门哲学",
          img1: require("../statics/img/teanew/5.jpg"),
          img2: require("../statics/img/teanew/6.jpg"),
          text1:
            "以前不管是在酒桌上、还是在茶几上总能听到主人说“酒满茶浅”来劝酒和劝茶，但对这句话的含义却一直是半知不解。直到有一天，同一位精于茶道的朋友一同饮茶，听他边斟边说：“从来茶倒七分满，留下三分是人情。”时才恍然大悟，深得其中韵味所在。",
          text2:
            "所谓“茶七酒八”，是指主人给客人倒茶斟酒时，茶杯、酒杯满到七八分的程度。主若以茶待客，则以倒七分为敬，不宜过满。当然这有很多种说法，今天为大家总结了以下几点：<p><span style='font-weight:700;'>1、</span>茶水倒七分满首先不至于烫着客人或洒到桌子及衣物上。</p><p><span style='font-weight:700;'>2、</span>品茶需要一遍遍品，一壶茶要平均倒好几杯，所以不可能一杯倒得太多。</p><p><span style='font-weight:700;'>3、</span>品茶时，不仅喝茶汤，还要看汤色、闻茶香，茶水太满品鉴起来不方便。</p><p><span style='font-weight:700;'>4、</span>茶水倒得七分满留得三分人情在，就如“君子之交淡如水”，只有一杯浅茶，在轻抿慢啜中方能悠悠地品出一番情谊来。</p><p><span style='font-weight:700;'>5、</span>茶杯倒七分茶水，茶水的面距离杯口有一定空间，茶水的清沁芳香就不容易失散，在饮茶前，能闻到浓郁的茶香。</p>",
          text3:
            "七分，也是对生活的一种分寸上的把握。行事把握分寸，说话留有余地，待人宽容之心，处世淡泊从容。茶倒七分满似乎也在提醒人们，为人做事一定要虚心谨慎，不骄不躁，不可锋芒毕露，要谦和含蓄，正所谓满招损，谦受益。",
          text4:
            " 留一点点情意，留一点点余闲，不要让自己活得太累。为人处事，“做人不要做绝，说话不要说尽。”要懂得为自己、为别人留有余地，明白“水满则溢，月盈则亏”的道理。",
          text5:
            "人生如白驹过隙、草露风灯，短暂得就像这片片茶叶。我们不应该刻意地去计较生活中的得失，我们应该活得实在、活得真切、活得淳朴、活得坦然。",
          text6:
            "功名利禄只是过眼云烟，不必为追求短暂的大红大紫而穷尽一生，其实人生如茶味一样清淡略带苦涩实。如果，如果我们肯给自己多一份宽松，在追名求利的空当儿抬头看一看蓝天白云，也回头望一望青山绿水，那么，我们的心便不会那么年轻的时候就已变得衰老坚硬，抱怨牢骚也不会纵横地写在脸上，而让我们失去了真诚的笑容。"
        },
        {
          titleName: "一杯清茶放空心灵的禅意",
          img1: require("../statics/img/teanew/7.jpg"),
          img2: require("/"),
          text1:
            "为了生活而忙碌，现在感觉生活压力，越来越大，烦恼越来越多，不知如何放松？如何解压？工作停不下来，下了班还整理家务或想着工作，有多少人泡一杯茶静下来过呢？更不用说禅茶了。在忙碌生活中学会享受生活，给自己泡一杯清茶，便有了放空心灵的禅意。",
          text2:
            "选择气温适中，还有穿来的凉风，空气特别清新的傍晚，是一种美的傍晚，在寂静的窗台前仰望夕阳下的天空，安静得只听见自己的呼吸。深吸一口气然后再慢慢吐纳，那些俗世中庸庸碌碌的烦恼，全都烟消云散，整个人，就此彻底安静下来。",
          text3:
            "选择禅修旅行，通常只奔着一个目标去：暂时放下日常生活的困扰，在修心过程中舒缓压力。",
          text4: " 一杯禅茶，推窗满眼山景。",
          text5:
            "茶在品，禅在参，经常会有来访的茶客问：这茶与禅，究竟是什么关系？大师答：如果只带有一颗品茶的心，那么只能品茶的味。而出家人参禅，其实不在于茶味的好坏与否，而在于通过品一杯茶的过程来悟心。",
          text6: " 悠悠香茗，搭配款款美味。",
          text7:
            " 按庞颖的说法，茶是有灵性的，在水中时，茶叶的每一个毛孔都是张开的，释放出的是它生长所在的那片山水和人文景观，品饮落肚自然生出无尽回味，唇齿留香。"
        },
        {
          titleName: "二马茶文化 | 闻香识茶",
          img1: require("/"),
          img2: require("/"),
          text1:
            "都说闻香识女人，也说美丽女子的灵魂有香气。可见，香所蕴含的意味，美好而高贵。自屈原在《离骚》中以香草美人譬喻高洁人品与忠直臣僚之后。香，从此便赋予了特殊含义。人类对香的运用，早在上古时代便开始了。人类发现了自然界各种令人舒畅的味道，闻之身心愉悦，于是认为天上的神灵应该也是喜欢这些味道的，因此在祭祀之时，供奉各种香草。香，初作为娱神的功用，代表人类表达对神的敬仰与虔诚。此后，人类也在其他重大仪式以及日常生活中，开始佩戴香草，并发展香文化。几千年下来，香文化亦如茶文化一般，生出许多支脉，同样成为拥有系统体系并博大精深的一门生活艺术。现今随着茶文化乃至传统文化的复兴，香道也在复兴的路上。",
          text2:
            "然而本篇所谈论的香，非香草香料之香，却是特殊的茶香。在茶的审评中，香气是一项重要的指标。那么，茶的种类如此繁多，茶之香，究竟可以归纳为多少种？真实的情况是，每一款茶，皆有其自身别具之香，纵使与别样茶有类似之处，却总会有属于自己的特质。正如世上没有两个一模一样的人，没有两片一模一样的树叶一样，每一款茶，因其所蕴含的内质不同，必然在外观和内容上，都会区别于其他茶。从香气的表现来讲，肯定也没有绝大部分一样的茶香。但若是这样细分，则会把这事变得极为复杂。如果不做研究，仅仅只作为一种知识来了解，以便帮助我们分别茶的种类和茶的优劣，则可以将茶香大概分为九大类型： 甜香、毫香、栗香、清香、花香、果香、松烟香、火香、陈香。",
          text3:
            "<span style='font-weight:700;'>甜香</span>，通常包含两种情况：其一，多见于火功足的高档茶，比如高级武夷岩茶，闻之除了火香之外，渐渐就能闻出甜香，入口明显觉得甜；其二，红茶普遍都有甜香，品饮过红茶之后的杯底，大多带有浓厚蜜糖的香味。",
          text4:
            "<span style='font-weight:700;'>毫香</span>，顾名思义，产生于多毫嫩芽制成的茶。多见于名优绿茶、白茶和高档红茶，台湾的东方美人茶，也有明显毫香。尤其白茶中的白毫银针，毫香为明显。",
          text5:
            "<span style='font-weight:700;'>栗香</span>，有两种：一种是嫩栗香。多见于春季用福鼎种或无锡大毫茶的鲜叶所制成的细嫩绿茶；另一种是板栗香，仿佛熟板栗的甜香。多见于制作中火功恰到好处的高档绿茶。如用福鼎种鲜叶加工的高档绿茶大多具有板栗香。",
          text6:
            "<span style='font-weight:700;'>清香</span>，清纯而悦鼻。多见于在杀青后经快速干燥的高档烘青或半烘半炒型绿茶。",
          text7:
            "<span style='font-weight:700;'>花香</span>，包括玫瑰香、桂花香、兰花香、茉莉香等等。花香在绿茶、红茶、乌龙茶中表现为明显。尤其凤凰单丛中，表达出花香的品种就难以准确计数。还有些花香是因为窨提的工艺所产生的，比如茉莉花香、桂花香等。这是在制作再加工茶时，由相应花朵传递给茶的香。",
          text8:
            "<span style='font-weight:700;'>果香</span>，此类香也非常丰富，有橘香、水蜜桃香、桂圆香等。橘香多见于发酵程度较轻的夏季红碎茶；水蜜桃香，多见于广东凤凰单丛、闽北武夷岩茶、台湾红茶等高档茶叶；桂圆香，多见于制作工艺良好的茯茶或用松烟熏过的红茶。",
          text9:
            "<span style='font-weight:700;'>松烟香</span>，指茶叶含有松脂燃烧的香气。多见于福建的小种红茶，也就是日常所说的“正山小种”，还有湖南安化的黑毛茶，初制时用松针燃烧烟熏，使茶叶吸附其特殊的香味。",
          text10:
            "<span style='font-weight:700;'>火香</span>，有足火香和高火香。足火香为茶叶香气中稍带焦糖香，常见于干燥温度较高的制品，比如在辉炒工序中采用较高锅温炒出的糙米色龙井茶。高火香似炒黄豆的香气，为黄大茶的典型香气。另外武夷岩茶也有典型火香，不过武夷岩茶的火香属于焦糖香。",
          text11:
            "<span style='font-weight:700;'>陈香</span>，茶叶陈化后产生的香气。是普洱茶、广西六堡茶、茯砖茶等黑茶的典型香气。但其他茶类若出现陈香，则表示茶不好。"
        }
      ],
      littleInfoListArr: [
        {
          titleName: "普洱茶生茶采摘及传统加工工艺流程",
          text1:
            "普洱茶生茶采摘大叶种鲜叶制成的晒青毛茶，其形态为散茶或压制成各种形状的紧压茶。"
        },
        {
          titleName: "韩国的传统茶饮茶习俗",
          text1:
            "韩国的传统茶是韩国饮茶的一种品类。本来韩国人的饮茶习俗是从中国传入的，起初的饮法与我国大体相同；可是他们在学习中国的煎茶法、点茶法和绝茶法的基础上，还衍生出一种煮茶法。煮茶就是将茶汤里的茶叶换成各种食料，而且还要加入蜂蜜或白糖。这种饮法至今仍然流行，与他们饮用中国绿茶的习惯并行不悖地存在着，为了区别干饮绿茶，他们称传统的饮茶法叫传统茶。"
        },
        {
          titleName: "茶倒七分，是人生的一门哲学",
          text1:
            "以前不管是在酒桌上、还是在茶几上总能听到主人说“酒满茶浅”来劝酒和劝茶，但对这句话的含义却一直是半知不解。直到有一天，同一位精于茶道的朋友一同饮茶，听他边斟边说：“从来茶倒七分满，留下三分是人情。”时才恍然大悟，深得其中韵味所在。"
        }
      ],
      lunboArr: [
        {
          pic: require("../statics/img/teanew/banner1.jpg"),
          txt: "二马茶文化 | 闻香识茶"
        },
        {
          pic: require("../statics/img/teanew/banner2.jpg"),
          txt: "茶倒七分，是人生的一门哲学"
        },
        {
          pic: require("../statics/img/teanew/banner3.jpg"),
          txt: "韩国的传统茶饮茶习俗"
        }
      ],
      reverse: false,
    };
  },
  methods: {
    postData(index) {
      
      localStorage.setItem('key',JSON.stringify({arr:this.infoListArr[index],index:index}))
      this.$router.push('/infoNews')
    }
  }
};
</script>
<style scoped>
@import "../statics/css/teanew.css";
</style>